Revit 2027 API
DoubleArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	ref double item,
	int index
)
Public Overridable Sub Insert (
	ByRef item As Double,
	index As Integer
)
public:
virtual void Insert(
	double% item,
	int index
)
abstract Insert :
        item : float byref *
        index : int -> unit
override Insert :
        item : float byref *
        index : int -> unit
Parameters
item Double
index Int32
See Also
Reference
DoubleArray Class
Autodesk.Revit.DB Namespace